DROP DATABASE library;

CREATE DATABASE IF NOT EXISTS library;

USE library;

CREATE TABLE books (
title VARCHAR (120) NOT NULL,
description VARCHAR(250) default "Опис відсутній",
date_of_publication DATE NOT NULL default "2018-01-01",
author VARCHAR (60) NOT NULL,
category VARCHAR (30) NOT NULL default "Категорія відсутня"
);

INSERT INTO books (title, description, date_of_publication, author, category)
VALUES 
("Гаррі Поттер і Кубок Вогню",
"Гаррі Поттер має четвертий рік навчання в Школі чарівництва «Хогвартс». Нові заклинання, нові зілля, нові вчителі, нові предмети ...",
"2007-08-08",
"Джоан Роулінг",
"Фентезі"),
(
"У списках не значився",
"Стримані екскурсоводи супроводжують групи по місцях боїв, і ви можете спуститися в підвали 333-го полку, доторкнутися до оплавленим вогнеметами цеглин, пройти до Тереспольское і Холмським воротам.",
"2005-03-09",
"Васильев Борис Львовичг",
"Про війну, класична література"),
(
"Три мушкетера ",
"Юний гасконець д'Артаньян сповнений зухвалих планів підкорити Париж. Його спритність, життєрадісність і благородство залучають до нього не тільки друзів, але й ворогів, які хотіли б бачити цього мужнього і віддану людину на своєму боці.",
"2008-05-07",
"Дюма Александр",
"Класична література");

INSERT INTO books (title, author, category)
VALUES 
("Французська вовчиця",
"Дрюон Морис",
"Зарубіжна класика"),
("Віднесені вітром",
"Маргарет Мітчелл",
"Любовний роман");

INSERT INTO books (title, description, author)
VALUES 
("Пригоди Шерлока Холмса",
"Збірник історій про пригоди Шерлока Холмса і його напарника доктора Ватсона",
"Артур Конан Дойл"),
("Граф Монте-Крісто",
"Справжнє життя Франсуа Піко під пером блискучого майстра історико-пригодницького жанру перетворилася в захоплюючу історію про Едмоні Дантесе, в'язня замку Іф. Зробивши зухвалу втечу, він повертається в рідне місто.",
"Олександр Дюма"),
("А зорі тут тихі...",
"Світлі образи дівчат, їх мрії і спогади про улюблені, створюють разючий контраст з нелюдським обличчям війни, яка не пожаліла їх - юних, які люблять, ніжних. Але і через смерть вони продовжують стверджувати життя і милосердя.",
"Васильев Борис Львович");

INSERT INTO books (title, description, date_of_publication, author, category)
VALUES
("Лілія і Лев",
"Охоплюючи період з першого десятиліття XIV століття до початку Столітньої війни між Францією і Англією, Дрюон описує, як збувається страшне прокляття протягом цих років.",
"2002-09-04",
"Дрюон Морис",
"Зарубіжна історична література"),
("Поліанна",
"Дивовижна історія дівчинки-сироти, вміння якої при будь-яких обставинах радіти життю, бачити у всьому кращу сторону допомагає не тільки їй самій, а й оточуючим її людям.",
"2001-09-03",
"Портер Элинор",
"Зарубіжна дитяча література");

SELECT * FROM books;





